use "431z_Shulz";

set DATEFORMAT dmy;

drop table if exists [dbo].[Add_Info_Students];
drop table if exists [dbo].[Estimates];
drop table if exists [dbo].[Students];
drop table if exists [dbo].[Groups];
drop table if exists [dbo].[Lecturer_Discipline];
drop table if exists [dbo].[Lecturers];
drop table if exists [dbo].[Discipline];


CREATE TABLE Discipline (
	id int identity(1, 1) primary key,
	name_discipline varchar(20) NOT NULL
);
INSERT INTO Discipline (name_discipline)
VALUES
	('Мат.анализ'),
	('Лин.алгебра'),
	('Отечеств.история'),
	('Информатика'),
	('Английский язык');


CREATE TABLE Groups (
	id int identity(1, 1) primary key,
	number varchar(6) NOT NULL,
	created_at smalldatetime NOT NULL,
	education_form varchar(25) NOT NULL default 'Очная',
	CHECK (Education_Form IN ('Очная', 'Очно-заочная', 'Заочное традиционное', 'Заочное дистанционное', 'Заочное сетевое', 'Заочное ускоренное', 'Заочное второе высшее')),
	price smallmoney NOT NULL,
	education_end bit NOT NULL
);
INSERT INTO Groups (number, created_at, education_form, price, education_end)
VALUES
	('411', '01-09-2020', 'Очная', 120000, 0),
	('422', '01-09-2020', 'Заочное традиционное', 60000, 0),
	('433', '01-09-2020', 'Заочное традиционное', 60000, 0),
	('444', '01-09-2020', 'Заочное дистанционное', 80000, 0);


CREATE TABLE Lecturers (
	id int identity(1, 1) primary key,
	last_name varchar(15) NOT NULL,
	first_name varchar(15) NOT NULL,
	middle_name varchar(15),
	gender varchar(7) DEFAULT 'Мужской' NOT NULL,
	date_of_birth smalldatetime NOT NULL,
	start_work smalldatetime NOT NULL,
	phone_number varchar(9),
);
INSERT INTO Lecturers
VALUES
	('Смирнова', 'Ирина', 'Петровна', 'Женский', '05-03-1961', '01-09-1995', '110-44-68'),
	('Миронов', 'Павел', 'Юрьевич', 'Мужской', '25-07-1940', '01-09-1992', '312-21-40'),
	('Гришин', 'Евгений', 'Сергеевич', 'Мужской', '05-12-1967', '01-09-1993', '260-23-65'),
	('Сергеева', 'Ольга', 'Ивановна', 'Женский', '12-02-1972', '01-09-2000', '234-85-69'),
	('Емец', 'Татьяна', 'Ивановна', 'Женский', '16-02-1971', '01-09-2000', '166-75-33'),
	('Игнатьева', 'Татьяна', 'Павловна', 'Женский', '30-05-1966', '01-09-1996', '210-36-98'),

	('Миронов', 'Алексей', 'Николаевич', 'Мужской', '30-07-1948', '01-09-1997', '166-75-33'),
	('Иванова', 'Вера', 'Николаевна', 'Женский', '15-03-1951', '01-09-1991', '145-19-81'),
	('Истомин', 'Валерий', 'Евгеньевич', 'Мужской', '23-10-1964', '01-09-1999', '136-28-94'),
	('Антонова', 'Алла', 'Андреевна', 'Женский', '24-01-1950', '01-09-1991', '377-45-92'),
	('Шохин', 'Сергей', 'Викторович', 'Мужской', '14-08-1967', '01-09-1991', '423-64-81'),
	('Литвинова', 'Лариса', 'Петровна', 'Женский', '26-04-1965', '01-09-1994', '211-87-90'),
	('Григорьев', 'Виктор', 'Владимирович', 'Мужской', '30-09-1970', '01-09-2000', '424-61-08'),
	('Иванов', 'Александр', 'Павлович', 'Мужской', '19-06-1955', '01-09-1991', '163-75-35'),
	('Минина', 'Ксения', 'Егоровна', 'Женский', '28-09-1954', '01-09-1998', '312-75-56'),
	('Абрамова', 'Ксения', 'Николаевна', 'Женский', '28-09-1954', '01-09-1998', '333-22-11'),
	('Быкова', 'Марина', 'Сергеевна', 'Женский', '28-09-1954', '01-09-1998', '444-55-11');

CREATE TABLE Students (
	id int IDENTITY(1, 1) PRIMARY KEY,
	last_name varchar(15) NOT NULL,
	first_name varchar(15) NOT NULL,
	middle_name varchar(15),
	gender varchar(7) DEFAULT 'Мужской' NOT NULL,
	date_of_birth smalldatetime NOT NULL,
	group_code int NOT NULL foreign key references Groups(ID) ON DELETE CASCADE,
	passport_series varchar(4),
	passport_id varchar(6),
	country varchar(15), 
	city varchar(20), 
	street varchar(30), 
	house varchar(10), 
	apartment varchar(5),
	phone_number varchar(16) default null,
	constraint CK_phone_number check (phone_number like '+7 [0-9][0-9][0-9] [0-9][0-9][0-9] [0-9][0-9] [0-9][0-9]')
);
INSERT INTO Students (last_name, first_name, middle_name, gender, date_of_birth, group_code, passport_series, passport_id, country, city, street, house, apartment, phone_number) 
VALUES 
--411
	('Мичуев', 'Илья', 'Серафимович', 'Мужской', '25.08.2000', 1, '4521', '192457', 'Россия', 'Москва', 'Центральная', '1', '23', '+7 937 729 56 78'),
	('Курбанов', 'Михаил', 'Яковлевич', 'Мужской', '08.07.2000', 1, '4321', '191434', 'Россия', 'Москва', 'Дзержинская', '2', '45', '+7 978 745 56 43'),
	('Михайлов', 'Дмитрий', 'Сергеевич', 'Мужской', '12-01-2001', 1, '4521', '182457', 'Россия', 'Москва', 'Центральная', '4', '78', '+7 999 567 56 21'),
	('Покровская', 'Марьяна', 'Климентьевна', 'Женский', '01.04.2001', 1, '4521', '162157', 'Россия', 'Москва', 'Маркса', '6', '98', null),
--422
	('Муравьев', 'Егор', 'Георгиевич', 'Мужской', '18.10.2000', 2, '4521', '002457', 'Россия', 'Москва', 'Центральная', '1', '23', null),
	('Чичканова', 'Вероника', 'Ростиславовна', 'Женский', '05.11.2001', 2, '4521', '165157', 'Россия', 'Москва', 'Маркса', '1', '118', '+7 888 467 21 34'),
	('Янишевская', 'Татьяна', 'Герасимовна', 'Женский', '13.01.1993', 2, '4521', '192665', 'Россия', 'Москва', 'Севастопольская', '9', '90', null),
--433
	('Ямалетдинов', 'Денис', 'Яковеевичевич', 'Мужской', '12.06.1997', 3, '4521', '009411', 'Россия', 'Москва', 'Центральная', '2', '11', null),
	('Штельмах', 'Александр', 'Романович', 'Мужской', '03.03.2000', 3, '4521', '180027', 'Россия', 'Москва', 'Центральная', '8', '89', '+7 999 567 33 56'),
	('Новожилова', 'Лариса', 'Герасимовна', 'Женский', '06.04.2000', 3, '4521', '165157', 'Россия', 'Москва', 'Маркса', '1', '118', null),
	('Лазуткина', 'Афанасия', 'Кирилловна', 'Женский', '12.10.2000', 3, '4521', '192665', 'Россия', 'Москва', 'Севастопольская', '9', '90', '+7 939 567 33 56'),
--444
	('Басов', 'Дмитрий', 'Романович', 'Мужской', '17.06.2000', 4, '4521', '009411', 'Россия', 'Москва', 'Центральная', '2', '11', null),
	('Головченко', 'Прохор', 'Никифорович', 'Мужской', '09.01.2001', 4, '4521', '190001', 'Россия', 'Москва', 'Дзержинская', '5', '6', null),
	('Карибжанов', 'Яков', 'Дмитриевич', 'Мужской', '06.12.2002', 4, '4521', '180027', 'Россия', 'Москва', 'Центральная', '8', '89', null),
	('Коренёва', 'Анфиса', 'Лукьяновна', 'Женский', '19.10.2000', 4, '4521', '165157', 'Россия', 'Москва', 'Маркса', '1', '118', null),
	('Аверьянова', 'Марьямна', 'Ефимовна', 'Женский', '06.10.2000', 4, '4521', '192665', 'Россия', 'Москва', 'Севастопольская', '9', '90', null);

CREATE TABLE Lecturer_Discipline (
	id int IDENTITY(1, 1) primary key,
	discipline_code int null foreign key references Discipline(id) ON DELETE CASCADE,
	lecturer_code int NOT NULL foreign key references Lecturers(id) ON DELETE CASCADE
);
INSERT INTO Lecturer_Discipline (discipline_code, lecturer_code)
VALUES 
--Преподаватель 1
	(1, 1),
	(2, 1),
--Преподаватель 2
	(1, 2),
	(4, 2),
--Преподаватель 3
	(1, 3),
	(2, 3),
--Преподаватель 4
	(2, 4),
	(4, 4),
--Преподаватель 5
	(2, 5),
	(1, 5),
--Преподаватель 6
	(2, 6),
	(4, 6),
--Преподаватель 7
	(3, 7),
--Преподаватель 8
	(3, 8),
--Преподаватель 9
	(3, 9),
--Преподаватель 10
	(4, 10),
	(1, 10),
--Преподаватель 11
	(4, 11),
	(1, 11),
--Преподаватель 12
	(1, 12),
	(4, 12),
--Преподаватель 13
	(5, 13),
--Преподаватель 14
	(5, 14),
--Преподаватель 15
	(5, 15),
	(null, 16),
	(null, 17);

CREATE TABLE Estimates (
	id int IDENTITY(1, 1),
	student_code int NOT NULL foreign key references Students(id),
	semester int NOT NULL,
	date_pass smalldatetime NOT NULL,
	lecturer_discipline_code int NOT NULL foreign key references Lecturer_Discipline(id) ON DELETE CASCADE,
	type_of_control varchar(15) NOT NULL,
	estimate int NOT NULL
);
INSERT INTO Estimates 
	(student_code, semester, date_pass, lecturer_discipline_code, type_of_control, estimate)
VALUES
-- 1 студент
	(1, 2, '10-05-2008', 1, 'Экзамен', 3),
	(1, 2, '15-05-2008', 2, 'Зачет', 1),
	(1, 2, '16-05-2008', 4, 'Экзамен', 3),
	(1, 2, '16-05-2008', 14, 'Тест', 2),
-- 2 студент
	(2, 2, '10-05-2008', 1, 'Экзамен', 4),
	(2, 2, '15-05-2008', 2, 'Зачет', 1),
	(2, 2, '16-05-2008', 4, 'Экзамен', 5),
	(2, 2, '16-05-2008', 14, 'Тест', 3),
-- 3 студент
	(3, 2, '10-05-2008', 1, 'Экзамен', 0),
	(3, 2, '15-05-2008', 2, 'Зачет', 1),
	(3, 2, '16-05-2008', 4, 'Экзамен', 2),
	(3, 2, '16-05-2008', 14, 'Тест', 4),
-- 4 студент
	(4, 2, '10-05-2008', 1, 'Экзамен', 5),
	(4, 2, '15-05-2008', 2, 'Зачет', 1),
	(4, 2, '16-05-2008', 4, 'Экзамен', 5),
	(4, 2, '16-05-2008', 14, 'Тест', 4),
-- 5 студент
	(5, 2, '10-05-2008', 1, 'Экзамен', 2),
	(5, 2, '15-05-2008', 2, 'Зачет', 1),
	(5, 2, '16-05-2008', 4, 'Экзамен', 4),
	(5, 2, '16-05-2008', 14, 'Тест', 3),


-- 6 студент
	(6, 4, '10-05-2008', 3, 'Экзамен', 4),
	(6, 4, '15-05-2008', 6, 'Зачет', 1),
	(6, 4, '16-05-2008', 8, 'Экзамен', 4),
	(6, 2, '16-05-2008', 22, 'Тест', 5),
-- 7 студент
	(7, 4, '10-05-2008', 3, 'Экзамен', 5),
	(7, 4, '15-05-2008', 6, 'Зачет', 1),
	(7, 4, '16-05-2008', 8, 'Экзамен', 3),
	(7, 2, '16-05-2008', 22, 'Тест', 4),
-- 8 студент
	(8, 4, '10-05-2008', 3, 'Экзамен', 2),
	(8, 4, '15-05-2008', 6, 'Зачет', 1),
	(8, 4, '16-05-2008', 8, 'Экзамен', 3),
	(8, 2, '16-05-2008', 22, 'Тест', 2),
-- 9 студент
	(9, 4, '10-05-2008', 3, 'Экзамен', 0),
	(9, 4, '15-05-2008', 6, 'Зачет', 1),
	(9, 4, '16-05-2008', 8, 'Экзамен', 5),
	(9, 2, '16-05-2008', 22, 'Тест', 2),
-- 10 студент
	(10, 4, '10-05-2008', 3, 'Экзамен', 4),
	(10, 4, '15-05-2008', 6, 'Зачет', 1),
	(10, 4, '16-05-2008', 8, 'Экзамен', 5),
	(10, 2, '16-05-2008', 22, 'Тест', 3),

	
-- 11 студент
	(11, 6, '10-05-2008', 5, 'Экзамен', 4),
	(11, 6, '15-05-2008', 14, 'Зачет', 1),
	(11, 6, '16-05-2008', 9, 'Экзамен', 3),
	(11, 2, '16-05-2008', 15, 'Тест', 3),
-- 12 студент
	(12, 6, '10-05-2008', 5, 'Экзамен', 5),
	(12, 6, '15-05-2008', 14, 'Зачет', 1),
	(12, 6, '16-05-2008', 9, 'Экзамен', 4),
	(12, 2, '16-05-2008', 15, 'Тест', 4),
-- 13 студент
	(13, 6, '10-05-2008', 5, 'Экзамен', 3),
	(13, 6, '15-05-2008', 14, 'Зачет', 1),
	(13, 6, '16-05-2008', 9, 'Экзамен', 3),
	(13, 2, '16-05-2008', 15, 'Тест', 4),
-- 14 студент
	(14, 6, '10-05-2008', 5, 'Экзамен', 4),
	(14, 6, '15-05-2008', 14, 'Зачет', 1),
	(14, 6, '16-05-2008', 9, 'Экзамен', 5),
	(14, 2, '16-05-2008', 15, 'Тест', 2),
-- 15 студент
	(15, 6, '10-05-2008', 5, 'Экзамен', 0),
	(15, 6, '15-05-2008', 14, 'Зачет', -1),
	(15, 6, '16-05-2008', 9, 'Экзамен', 5),
	(15, 2, '16-05-2008', 15, 'Тест', 3),

-- 16 студент
	(16, 8, '10-05-2008', 10, 'Экзамен', 4),
	(16, 8, '15-05-2008', 14, 'Зачет', 1),
	(16, 8, '16-05-2008', 9, 'Экзамен', 5),
	(16, 2, '16-05-2008', 11, 'Тест', 3);


CREATE TABLE Add_Info_Students(
	id int IDENTITY(1, 1) foreign key references Students(id),
	passport_series varchar(4),
	passport_id varchar(6),
	country varchar(15), 
	city varchar(20), 
	street varchar(30), 
	house varchar(10), 
	apartment varchar(5)
);
INSERT INTO Add_Info_Students (passport_series, passport_id, country, city, street, house, apartment) SELECT passport_series, passport_id, country, city, street, house, apartment FROM Students;
ALTER TABLE Students DROP COLUMN passport_series, passport_id, country, city, street, house, apartment;